Repository: pingfangx/TranslatorX-other
Catalog: Kotlin/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: CoroutineExceptionHandler context element on a root coroutine can be used as a generic catch block for this root coroutine and all its children where custom exception handling may take place.
zh_cn: 根 协程上的 CoroutineExceptionHandler 上下文元素，可以用作此根协程及其所有子协程的通用 catch 块，在块中可以进行自定义异常处理。

source: CoroutineExceptionHandler implementation is not used for child coroutines.
zh_cn: CoroutineExceptionHandler 实现不用于子协程。

source: CoroutineExceptionHandler is invoked only on uncaught exceptions —— exceptions that were not handled in any other way.
zh_cn: CoroutineExceptionHandler 仅在 uncaught 异常时调用，这些异常没有以任何其他方式处理。

source: kotlinx.coroutines is a rich library for coroutines developed by JetBrains.
zh_cn: kotlinx.coroutines 是由 Jetbrains 开发的丰富的协程库。

source: buffer() stores emitted values and runs the flow collector in a separate coroutine.
zh_cn: buffer() 存储发射的值，并在单独的协程中运行流收集器。

source: Thread confinement is an approach to the problem of shared mutable state where all access to the particular shared state is confined to a single thread.
zh_cn: Thread confinement (线程限制) 是一种解决共享可变状态问题的方法，其中对特定共享状态的所有访问都限制在单个线程中。

source: A Channel is conceptually very similar to BlockingQueue.
zh_cn: Channel 在概念上与 BlockingQueue 非常相似。

source: A CompletableDeferred communication primitive, that represents a single value that will be known (communicated) in the future, is used here for that purpose.
zh_cn: 此处使用了一个表示将来已知(通信)的单个值的 CompletableDeferred 通信原语。

source: A further Supervision section of this document gives more details.
zh_cn: 本文档的 Supervision 部分提供了更多详细信息。

source: A good example of such a requirement is a UI component with the job defined in its scope.
zh_cn: 这种需求的一个很好的例子是在其作用域内定义了作业的 UI 组件。

source: A pipeline is a pattern where one coroutine is producing, possibly infinite, stream of values:
zh_cn: 管道（pipeline）是一种模式，用于协程生产（可能是无限的）值流：

source: A simple actor can be written as a function, but an actor with a complex state is better suited for a class.
zh_cn: 简单的 actor 可以编写为函数，但具有复杂状态的 actor 更适合用类表示。

source: Actor is more efficient than locking under load, because in this case it always has work to do and it does not have to switch to a different context at all.
zh_cn: Actor 比在负载下锁定更有效，因为在这种情况下，它总是有工作要做，而且根本不需要切换到不同的上下文。

source: Add a call to the buffer() function to run the emitter and collector concurrently.
zh_cn: 添加对 buffer() 函数的调用，以同时运行发射器和收集器。

source: Add a concurrently running coroutine
zh_cn: 添加并发运行的协程

source: Additional references
zh_cn: 其他参考资料

source: All additional exceptions that happen after the first one are attached to the first exception as suppressed ones.
zh_cn: 在第一个异常之后发生的所有其他异常都作为抑制异常附加到第一个异常。

source: All functions that create coroutines are defined as extensions on CoroutineScope, so that we can rely on structured concurrency to make sure that we don't have lingering global coroutines in our application.
zh_cn: 所有创建协程的函数都被定义为 CoroutineScope 上的扩展，因此我们可以依靠 structured concurrency 来确保我们的应用程序中没有常驻的全局协程。

source: Also, pay attention to how we explicitly iterate over channel with for loop to perform fan-out in launchProcessor code.
zh_cn: 另外，请注意我们如何使用 for 循环显式迭代通道，以在 launchProcessor 代码中执行扇出。

source: An actor is an entity made up of a combination of a coroutine, the state that is confined and encapsulated into this coroutine, and a channel to communicate with other coroutines.
zh_cn: actor 是一个实体，由一个协程、被限制并封装在该协程中的状态，以及一个与其他协程通信的通道组成。

source: An actor is a coroutine and a coroutine is executed sequentially, so confinement of the state to the specific coroutine works as a solution to the problem of shared mutable state.
zh_cn: actor 是一个协程，而协程是按顺序执行的，因此将状态限制在特定的协程中可以解决共享可变状态的问题。

source: An actor is associated with the channel that it receives messages from, while a producer is associated with the channel that it sends elements to.
zh_cn: actor 与它从中接收消息的通道相关联，而 producer 与它向其发送元素的通道相关联。

source: And another coroutine or coroutines are consuming that stream, doing some processing, and producing some other results.
zh_cn: 另外一个或多个协程正在使用该流，进行一些处理，并产生一些其他结果。

source: Another crucial difference between regular and supervisor jobs is exception handling.
zh_cn: 常规工作和 supervisor 工作之间的另一个关键区别是异常处理。

source: Another example is a server process that spawns multiple child jobs and needs to supervise their execution, tracking their failures and only restarting the failed ones.
zh_cn: 另一个例子是一个服务器进程，它生成多个子作业，需要 supervise (监督) 它们的执行，跟踪它们的失败并只重新启动失败的作业。

source: Anyway, this is an extremely impractical way to find prime numbers.
zh_cn: 无论如何，这是一种非常不切实际的寻找质数的方法。

source: As we have studied before, cancellation is a bidirectional relationship propagating through the whole hierarchy of coroutines.
zh_cn: 正如我们之前所研究的，取消是一种双向关系，在整个协程层次结构中传播。

source: Both Channel() factory function and produce builder take an optional capacity parameter to specify buffer size.
zh_cn: Channel() 工厂函数和 produce 构建器都接受可选的 capacity 参数来指定 buffer size (缓冲区大小)。

source: Buffer allows senders to send multiple elements before suspending, similar to the BlockingQueue with a specified capacity, which blocks when buffer is full.
zh_cn: 缓冲区允许发送者在挂起之前发送多个元素，类似于具有指定容量的 BlockingQueue，该队列在缓冲区满时阻塞。

source: Buffered channels
zh_cn: 缓冲通道

source: Build the code by clicking Build Project.
zh_cn: 通过点击 Build Project 来构建代码。

source: Building channel producers
zh_cn: 构建通道生产者

source: Cancellation and exceptions
zh_cn: 取消和异常

source: Cancellation exceptions are transparent and are unwrapped by default:
zh_cn: 取消异常是透明的，默认情况下会取消包装：

source: Cancellation is closely related to exceptions.
zh_cn: 取消与异常密切相关。

source: Change code in the main() function:
zh_cn: 更改 main() 函数中的代码：

source: Change the code in the main() function:
zh_cn: 更改 main() 函数中的代码：

source: Channel basics
zh_cn: 通道基础

source: Channels
zh_cn: 通道

source: Channels are fair
zh_cn: 通道是公平的

source: Channels provide a way to transfer a stream of values.
zh_cn: 通道提供了一种传输值的流的方法。

source: Closing and iteration over channels
zh_cn: 关闭和迭代渠道

source: Collect the emitted values using the collect() function.
zh_cn: 使用 collect() 函数来收集发射的值。

source: Conceptually, a close is like sending a special close token to the channel.
zh_cn: 从概念上讲，close 类似于向通道发送特殊的关闭指令。

source: Coroutine builders come in two flavors: propagating exceptions automatically (launch and actor) or exposing them to users (async and produce).
zh_cn: 协程构建器有两种风格：自动传播异常(launch 和 actor)或向用户公开异常(async 和 produce)。

source: Coroutine exceptions handling
zh_cn: 协程异常处理

source: Coroutine's alternative is called Mutex.
zh_cn: 协程的替代方案称为 Mutex。

source: Coroutines can be executed parallelly using a multi-threaded dispatcher like the Dispatchers.Default.
zh_cn: 协程可以通过使用多线程调度器(如 Dispatchers.Default 来并行执行。

source: Coroutines guide
zh_cn: 协程指南

source: Coroutines internally use CancellationException for cancellation, these exceptions are ignored by all handlers, so they should be used only as the source of additional debug information, which can be obtained by catch block.
zh_cn: 协程内部使用 CancellationException 进行取消，所有处理程序都会忽略这类异常，因此它们只能用作附加调试信息的源，这些信息可以通过 catch 块获得。

source: Coroutines running in supervision scope do not propagate exceptions to their parent and are excluded from this rule.
zh_cn: 在 supervision 作用域内运行的协程不会将异常传播到其父级，并且不在此规则中。

source: Create a Kotlin flow with a slow emitter and a slow collector:
zh_cn: 使用慢速发射器和慢速收集器创建 Kotlin flow：

source: Create a Kotlin flow
zh_cn: 创建一个 Kotlin 流

source: Create coroutines
zh_cn: 创建协程

source: Create the simple() function that returns a flow of three numbers:
zh_cn: 创建返回三个数字流的 simple() 函数：

source: Creating a root coroutine for the whole application is one of the rare legitimate uses for GlobalScope, so you must explicitly opt-in into using GlobalScope with @OptIn(DelicateCoroutinesApi::class).
zh_cn: 为整个应用程序创建根协程是 GlobalScope 罕见的合法用途之一，因此在使用 GlobalScope 时应显示地使用 @OptIn(DelicateCoroutinesApi::class) 注解。

source: Debug Kotlin Flow using IntelliJ IDEA – tutorial
zh_cn: 使用 IntelliJ IDEA 调试 Kotlin 流–教程

source: Debug a Kotlin flow with two coroutines
zh_cn: 调试使用两个协程的 Kotlin 流

source: Debug coroutines
zh_cn: 调试协程

source: Debug coroutines using IntelliJ IDEA – tutorial
zh_cn: 使用 IntelliJ IDEA 调试协程–教程

source: Debug the coroutine
zh_cn: 调试协程

source: Debugging works for kotlinx-coroutines-core version 1.3.8 or later.
zh_cn: 调试适用于 kotlinx-coroutines-core 版本 1.3.8 或更高版本。

source: Deferred values provide a convenient way to transfer a single value between coroutines.
zh_cn: 延迟值提供了一种方便的方法，可以在协程之间传输单个值。

source: Each individual increment switches from multi-threaded Dispatchers.Default context to the single-threaded context using withContext(counterContext) block.
zh_cn: 每个单独的自增操作，从多线程 Dispatchers.Default 上下文使用 withContext(counterContext) 块切换到单线程上下文。

source: Enhance the code to run the emitter and collector concurrently:
zh_cn: 增强代码以同时运行发射器和收集器：

source: Even though "ping" coroutine immediately starts receiving the ball again after sending it back to the table, the ball gets received by the "pong" coroutine, because it was already waiting for it:
zh_cn: 尽管“ping”协程在将球送回桌上后立即开始再次接球，但“pong”协程还是会先收到球，因为它已经在等待它了：

source: Every child should handle its exceptions by itself via the exception handling mechanism.
zh_cn: 每个协协程都应该通过异常处理机制自己处理自己的异常。

source: Exception propagation
zh_cn: 异常传播

source: Exceptions aggregation
zh_cn: 异常聚合

source: Exceptions in supervised coroutines
zh_cn: supervised 协程中的异常

source: For example, let us have a channel of strings, and a suspending function that repeatedly sends a specified string to this channel with a specified delay:
zh_cn: 例如，让我们有一个字符串通道，以及一个挂起函数，该函数以指定的延迟向该通道重复发送指定的字符串：

source: Here we look at what happens if an exception is thrown during cancellation or multiple children of the same coroutine throw an exception.
zh_cn: 这里我们来看一下如果在取消过程中抛出异常，或者同一个协程的多个子协程抛出异常，会发生什么。

source: However, it does not easily scale to complex state or to complex operations that do not have ready-to-use thread-safe implementations.
zh_cn: 然而，它不容易扩展到复杂状态或没有现成线程安全实现的复杂操作。

source: However, it is a good choice for some situations where you absolutely must modify some shared state periodically, but there is no natural thread that this state is confined to.
zh_cn: 然而，在某些情况下它是一个不错的选择，例如你必须定期修改某些共享状态，但这些状态并未局限于自然线程。

source: However, the benefit of a pipeline that uses channels as shown above is that it can actually use multiple CPU cores if you run it in Dispatchers.Default context.
zh_cn: 然而，如上所示使用通道的管道的好处是，如果在 Dispatchers.Default 上下文中运行它，实际上可以使用多个 CPU 内核。

source: If a coroutine encounters an exception other than CancellationException, it cancels its parent with that exception.
zh_cn: 如果协程遇到了除 CancellationException 之外的异常，它会使用该异常取消其父协程。

source: If any of the UI's child tasks have failed, it is not always necessary to cancel (effectively kill) the whole UI component, but if the UI component is destroyed (and its job is cancelled), then it is necessary to cancel all child jobs as their results are no longer needed.
zh_cn: 如果 UI 的任何子任务失败，并不总是需要取消(有效地杀死)整个 UI 组件，但如果 UI 组件被销毁(其作业被取消)，则有必要取消所有子作业，因为不再需要它们的结果。

source: If one of the processor coroutines fails, then others would still be processing the channel, while a processor that is written via consumeEach always consumes (cancels) the underlying channel on its normal or abnormal completion.
zh_cn: 如果其中一个处理器协程失败，那么其他处理器仍将处理该通道，而通过 consumeEach 编写的处理器始终在正常或异常完成时消费(取消)其通道。

source: If send is invoked first, then it is suspended until receive is invoked, if receive is invoked first, it is suspended until send is invoked.
zh_cn: 如果先调用 send，则在调用 receive 之前挂起，如果先调用 receive，则在调用 send 之前挂起。

source: If you don't have a project, create one.
zh_cn: 如果你没有项目，先创建一个。

source: In a blocking world you'd typically use synchronized or ReentrantLock for that.
zh_cn: 在阻塞世界（译注：指不使用协程）中，您通常会使用 synchronized 或 ReentrantLock 来实现这一点。

source: In addition to that, async builder always catches all exceptions and represents them in the resulting Deferred object, so its CoroutineExceptionHandler has no effect either.
zh_cn: 除此之外，async 构建器始终捕获所有异常，并在结果的 Deferred 对象中表示它们，因此其 CoroutineExceptionHandler 也没有任何效果。

source: In order to use coroutines as well as follow the examples in this guide, you need to add a dependency on the kotlinx-coroutines-core module as explained in the project README.
zh_cn: 为了遵循本指南中的示例使用协程，你需要添加添加 kotlinx-coroutines-core 依赖，如项目 README 文件中所述。

source: In particular, all children coroutines (coroutines created in the context of another Job) delegate handling of their exceptions to their parent coroutine, which also delegates to the parent, and so on until the root, so the CoroutineExceptionHandler installed in their context is never used.
zh_cn: 特别是，所有 子 协程(在另一个 Job 的上下文中创建的协程)都将其异常的处理委托给父协程，父协程也会委托给父协程，依此类推，直到根协程，因此永远不会使用在其上下文中安装的 CoroutineExceptionHandler。

source: In practice, pipelines do involve some other suspending invocations (like asynchronous calls to remote services) and these pipelines cannot be built using sequence/iterator, because they do not allow arbitrary suspension, unlike produce, which is fully asynchronous.
zh_cn: 在实践中，管道确实涉及一些其他挂起调用(比如对远程服务的异步调用)，这些管道不能使用 sequence/iterator 构建，因为它们不允许任意挂起，而 produce 是完全异步的。

source: In practice, thread confinement is performed in large chunks, e.g. big pieces of state-updating business logic are confined to the single thread.
zh_cn: 实践中，线程限制是在大块中执行的，例如，状态更新业务逻辑的大块被限制在单个线程中。

source: In the Coroutines tab, you can see that there are two coroutines running concurrently.
zh_cn: 在 Coroutines 选项卡中，您可以看到有两个协程同时运行。

source: In the case of a simple counter we can use AtomicInteger class which has atomic incrementAndGet operations:
zh_cn: 在简单计数器的情况下，我们可以使用具有原子 incrementAndGet 运算的 AtomicInteger 类：

source: In the example below, the numbers are just squared:
zh_cn: 在下面的例子中，仅对数字做了平方：

source: In the following example two coroutines "ping" and "pong" are receiving the "ball" object from the shared "table" channel.
zh_cn: 在下面的示例中，两个协程“ping”和“pong”从共享的“table”通道接收“ball”对象。

source: In these examples, CoroutineExceptionHandler is always installed to a coroutine that is created in GlobalScope.
zh_cn: 在这些示例中，CoroutineExceptionHandler 始终安装到在 GlobalScope 中创建的协程。

source: In this example, they just print their id and received number:
zh_cn: 在本例中，他们只需打印自己的 id 和收到的数字：

source: Indeed, actors may modify their own private state, but can only affect each other through messages (avoiding the need for any locks).
zh_cn: 实际上，actor 可以修改自己的私有状态，但只能通过消息相互影响(避免任何锁的需要)。

source: Instead of coroutineScope, we can use supervisorScope for scoped concurrency.
zh_cn: 我们可以使用 supervisorScope 来实现 scoped (作用域) 并发，而不用 coroutineScope。

source: It also waits for all children before completion just like coroutineScope does.
zh_cn: 它也会像 coroutineScope 一样等待所有子协程完成。

source: It can be demonstrated by a simple example that creates root coroutines using the GlobalScope:
zh_cn: 可以通过一个简单的示例来演示，该示例使用 GlobalScope 创建根协程：

source: It contains a number of high-level coroutine-enabled primitives that this guide covers, including launch, async and others.
zh_cn: 它包含本指南涵盖的许多高级的协程启用原语，包括 launch，async 等。

source: It does not block a thread.
zh_cn: 它不会阻塞线程。

source: It does not make sense to install an exception handler to a coroutine that is launched in the scope of the main runBlocking, since the main coroutine is going to be always cancelled when its child completes with exception despite the installed handler.
zh_cn: 将异常处理程序安装到在主 runBlocking 作用域内启动的协程中是没有意义的，因为尽管安装了异常处理程序，但当其子进程异常完成时，主协程总是会被取消。

source: It does not matter (for correctness) what context the actor itself is executed in.
zh_cn: (对于正确性)actor 本身在什么环境中执行并不重要。

source: It has lock and unlock functions to delimit a critical section.
zh_cn: 它有 lock 和 unlock 函数来划分关键区域。

source: It is easy to apply with coroutines by using a
zh_cn: 在协程中应用很简单，只需使用

source: It is highly unlikely to ever print "Counter = 100000", because a hundred coroutines increment the counter concurrently from multiple threads without any synchronization.
zh_cn: 打印“Counter=100000”的可能性很小，因为一百个协程同时从多个线程递增 counter，而没有任何同步。

source: It is possible to customize the default behavior of printing uncaught exceptions to the console.
zh_cn: 可以自定义将 uncaught 异常打印到控制台的默认行为。

source: It is similar to Thread.uncaughtExceptionHandler.
zh_cn: 它类似于 Thread.uncaughtExceptionHandler。

source: It is similar to a regular Job with the only exception that cancellation is propagated only downwards.
zh_cn: 它类似于常规的 Job，唯一的区别是取消只会向下传播。

source: It is typically used in UI applications, where all UI state is confined to the single event-dispatch/application thread.
zh_cn: 它通常用于 UI 应用程序，其中所有 UI 状态都限制于单个事件分派/应用程序线程。

source: It means that coroutines launched directly inside the supervisorScope do use the CoroutineExceptionHandler that is installed in their scope in the same way as root coroutines do (see the CoroutineExceptionHandler section for details).
zh_cn: 这意味着直接在 supervisorScope 内 launch 的协程，会使用安装在其作用域内的 CoroutineExceptionHandler，与根协程相同(有关详细信息，请参阅 CoroutineExceptionHandler 部分)。

source: It presents all the usual parallelism problems.
zh_cn: 它表现了所有常见的并行性问题。

source: It prints "sending" five times using a buffered channel with capacity of four:
zh_cn: 使用容量为四个的缓冲通道时，打印了 5 次“sending”：

source: It prints following lines:
zh_cn: 它打印以下行：

source: It propagates the cancellation in one direction only and cancels all its children only if it failed itself.
zh_cn: 它只在一个方向上传播取消，并且仅在自身失败时才取消其所有子项。

source: It shows that there are three coroutines.
zh_cn: 它显示有三个协程。

source: It suspends the coroutine for 100 ms without blocking the thread.
zh_cn: 它会在不阻塞线程的情况下挂起协程 100 毫秒。

source: It suspends the coroutine for 300 ms without blocking the thread.
zh_cn: 它会在不阻塞线程的情况下挂起协程 300 毫秒。

source: It works for plain counters, collections, queues and other standard data structures and basic operations on them.
zh_cn: 它适用于普通计数器、集合、队列和其他标准数据结构，以及对它们的基本操作。

source: Kotlin's sealed classes are well suited for that purpose.
zh_cn: Kotlin 的 sealed classes 非常适合这一目的。

source: Kotlin, as a language, provides only minimal low-level APIs in its standard library to enable various other libraries to utilize coroutines.
zh_cn: Kotlin 作为一门语言，在其标准库中只提供最低限度的低级 API，以使其他各种库能够利用协程。

source: Let us launch a hundred coroutines all doing the same action a thousand times.
zh_cn: 让我们启动 100 个协程，所有这些协程都执行相同的操作 1000 次。

source: Let us start with a producer coroutine that is periodically producing integers (ten numbers per second):
zh_cn: 让我们从周期性地产生整数(每秒十个数字)的生产者协程开始：

source: Let us take a look at the case when unidirectional cancellation is required.
zh_cn: 让我们看看需要单向取消的情况。

source: Let us try it:
zh_cn: 让我们试一下：

source: Let's take pipelines to the extreme with an example that generates prime numbers using a pipeline of coroutines.
zh_cn: 让我们用一个例子来将管道发挥到极致，这个例子使用一系列协程生成质数。

source: Moreover, Kotlin's concept of suspending function provides a safer and less error-prone abstraction for asynchronous operations than futures and promises.
zh_cn: 此外，Kotlin 的 挂起函数 的概念为异步操作提供了一种比 future 和 promise 更安全、更不容易出错的抽象。

source: Multiple coroutines may receive from the same channel, distributing work between themselves.
zh_cn: 多个协程可以从同一个通道接收，在它们之间分配工作。

source: Multiple coroutines may send to the same channel.
zh_cn: 多个协程可以发送到同一个通道。

source: Mutual exclusion
zh_cn: 互斥

source: Mutual exclusion solution to the problem is to protect all modifications of the shared state with a critical section that is never executed concurrently.
zh_cn: 该问题的互斥解决方案是保护共享状态的所有修改，使其具有一个决不会同时执行的 critical section (关键部分)。

source: Normally, the handler is used to log the exception, show some kind of error message, terminate, and/or restart the application.
zh_cn: 通常，处理程序用于记录异常、显示某种错误消息、终止和/或重新启动应用程序。

source: Note that ticker is aware of possible consumer pauses and, by default, adjusts next produced element delay if a pause occurs, trying to maintain a fixed rate of produced elements.
zh_cn: 请注意，ticker 知道可能的消费者暂停，并且默认情况下，如果暂停发生，会调整下一个生产的元素延迟，试图保持生产元素的固定速率。

source: Note that an actor coroutine builder is a dual of produce coroutine builder.
zh_cn: 请注意，actor 协程构建器是 produce 协程构建器的对偶（译注：a dual of）。

source: Note that cancelling a producer coroutine closes its channel, thus eventually terminating iteration over the channel that processor coroutines are doing.
zh_cn: 请注意，取消生产者协程将关闭其通道，从而最终终止处理器协程正在进行的通道上的迭代。

source: Note that sometimes channels may produce executions that look unfair due to the nature of the executor that is being used.
zh_cn: 请注意，由于所使用的执行者的性质，有时通道可能会产生看起来不公平的执行。

source: Note that this mechanism currently only works on Java version 1.7+.
zh_cn: 请注意，这种机制目前仅适用于 Java 1.7+ 版本。

source: Note that you can build the same pipeline using iterator coroutine builder from the standard library.
zh_cn: 请注意，你可以使用标准库的 iterator 协程构建器来构建相同的管道。

source: Note: This above code will work properly only on JDK7+ that supports suppressed exceptions
zh_cn: 注意：上述代码仅在支持 suppressed 异常的 JDK7+ 上正常工作

source: Now let us launch five processors and let them work for almost a second.
zh_cn: 现在让我们启动五个处理器，让它们工作近一秒钟。

source: Now let's see how it works in practice:
zh_cn: 现在让我们看看它在实践中是如何工作的：

source: Now the Coroutines tab shows the following:
zh_cn: 现在，Coroutines 选项卡显示以下内容：

source: Now the collector coroutine has the RUNNING status, while the emitter coroutine has the SUSPENDED status.
zh_cn: 现在收集器协程的状态为 RUNNING，而发射器协程的状态为 SUSPENDED。

source: Now the flow emits the second value.
zh_cn: 现在，流将发出第二个值。

source: Now we build our pipeline by starting a stream of numbers from 2, taking a prime number from the current channel, and launching new pipeline stage for each prime number found:
zh_cn: 现在，我们通过从 2 开始一系列数字，从当前通道中获取一个质数，并为找到的每个质数启动新的管道阶段来构建管道：

source: Now, let us see what happens if we launch a couple of coroutines sending strings (in this example we launch them in the context of the main thread as main coroutine's children):
zh_cn: 现在，让我们看一下如果我们启动几个发送字符串的协程会发生什么(在本例中，我们在主线程的上下文中作为主协程的子协程来启动它们)：

source: On the receiver side it is convenient to use a regular for loop to receive elements from the channel.
zh_cn: 在接收端，可以方便地使用常规的 for 循环来接收来自通道的元素。

source: One key difference is that instead of a blocking put operation it has a suspending send, and instead of a blocking take operation it has a suspending receive.
zh_cn: 一个关键区别是，它没有阻塞的 put 操作，而是提供挂起的 send，没有阻塞的 take 操作，而是提供挂起的 receive。

source: Open a Kotlin project in IntelliJ IDEA.
zh_cn: 在 IntelliJ IDEA 中打开一个 Kotlin 项目。

source: Open the main.kt file in src/main/kotlin.
zh_cn: 打开位于 src/main/kotlin 中的 main.kt 文件。

source: Optionally, a mode parameter equal to TickerMode.FIXED_DELAY can be specified to maintain a fixed delay between elements.
zh_cn: 可选地，指定一个等于 TickerMode.FIXED_DELAY 的 mode 参数来保持元素之间的固定延迟。

source: Pipelines
zh_cn: 管道

source: Prime numbers with pipeline
zh_cn: 使用管道的质数

source: Print the collected value from the flow using the println() function.
zh_cn: 使用 println() 函数打印从流中收集的值。

source: Produce the values in the for loop using the emit() function.
zh_cn: 使用 emit() 函数在 for 循环中产生值。

source: Replace produce with iterator, send with yield, receive with next, ReceiveChannel with Iterator, and get rid of the coroutine scope.
zh_cn: 将 produce 替换为 iterator，send 替换为 yield，receive 替换为 next，ReceiveChannel 替换为 Iterator，并摆脱协程作用域。

source: Resume the debugger session by clicking Resume Program in the Debug tool window.
zh_cn: 通过单击 Debug 工具窗口中的 Resume Program 来继续调试器会话。

source: Resume the debugger session by clicking Resume Program in the Debug tool window:
zh_cn: 通过单击 Debug 工具窗口中的 Resume Program 来继续调试器会话：

source: Run the code in debug mode by clicking Debug next to the run configuration at the top of the screen.
zh_cn: 在调试模式下运行代码，方法是单击屏幕顶部运行配置旁边的 Debug 。

source: See this issue for details.
zh_cn: 有关详细信息，请参阅 该 issue。

source: See what happens:
zh_cn: 看看会发生什么：

source: Send and receive operations to channels are fair with respect to the order of their invocation from multiple coroutines.
zh_cn: 就多个协程调用通道的顺序而言，通道的发送和接收操作是 公平的。
